       IDENTIFICATION DIVISION.
       PROGRAM-ID. JETPAY.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY "payroll.cpy".
       PROCEDURE DIVISION USING PAYROLL-RECORD.
           ADD 1.25 TO GROSS-PAY
           GOBACK.
       END PROGRAM JETPAY.
